{"Position Title": "Data Engineer", "Position Location": "Moscow, ID ", "Team": "Corporate", "Category": "Data and Analytics ", "Position Description": "We are looking for a highly motivated data engineer who will find optimal ways to process and enrich messy user-submitted data which will help us better answer questions about the workforce, educational programs, and job opportunities. In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder. ", "Retrieval Date": "2021-02-18", "Link": "https://jobs.lever.co/economicmodeling/b18b606e-bc98-443b-ab72-852cedd71776", "Company": "economicmodeling", "id": "b18b606e-bc98-443b-ab72-852cedd71776"}
{"Position Title": "Commercial Account Executive", "Position Location": "Moscow, ID ", "Team": "Talent", "Category": "Sales ", "Position Description": "Emsi is the leader in Enterprise big data analytics, delivering our software solutions to support mission-critical decisions for our clients.  Visit us at www.economicmodeling.com.   We are looking for talented Account Executives who will help us develop long-term client relationships within defined multi-state territories.  In this role you will develop and close new business through your own prospecting as well as through our partner/channel environment.  Our territories are massive, and the opportunity for growth and quota retirement are real.  We value hunger, intelligence, and a professional who conducts business with impeccable integrity.   ", "Retrieval Date": "2021-02-18", "Link": "https://jobs.lever.co/economicmodeling/7e877539-d5fb-43fb-933c-a960c958501c", "Company": "economicmodeling", "id": "7e877539-d5fb-43fb-933c-a960c958501c"}
{"Position Title": "Product Manager, Global Job Postings", "Position Location": "Moscow, ID ", "Team": "Talent", "Category": "Product ", "Position Description": "Emsi is a leader in global labor analytics, helping a wide variety of clientele from higher education institutions to city/state governments as well as Fortune 1000 companies. We’ve built our company on the integrity of our data and the drive to be insatiably curious when it comes to solving our client’s talent issues. We’re looking for someone who is passionate about blessing customers to fill this Product role.  This role specifically will be focused on leading Emsi’s effort to expand our global footprint in regards to job postings data. This will range from monitoring sources, establishing quality processes, identify key customer requests, work on expanding insights to be extracted from the data and engage with customers on best use cases. You will be working with the Global Product Owner and Data Engineering teams to build solutions.", "Retrieval Date": "2021-02-18", "Link": "https://jobs.lever.co/economicmodeling/349ca93d-fcb7-494f-88a8-8f75712c8e86", "Company": "economicmodeling", "id": "349ca93d-fcb7-494f-88a8-8f75712c8e86"}
{"Position Title": "Business Development Representative", "Position Location": "Moscow, ID ", "Team": "Talent", "Category": "Sales ", "Position Description": "Position Overview  We are looking for talented Business Development Reps who will help us find and develop new client relationships.  The BDR will work with our sales team and develop leads for our Account Executives through outbound marketing and messaging to targeted accounts.  We value integrity, intelligence, good humor, and a professional who wants to learn, grow, and earn.  Successful performers will be first in line for promotion to a closing role.", "Retrieval Date": "2021-02-18", "Link": "https://jobs.lever.co/economicmodeling/1999a4b5-0783-45d9-843a-e50d86263831", "Company": "economicmodeling", "id": "1999a4b5-0783-45d9-843a-e50d86263831"}
{"Position Title": "Product Specialist", "Position Location": "Moscow, ID ", "Team": "Higher Education", "Category": "Product ", "Position Description": "Provide technical expertise and support to customer needs, internal processes, and product teams. In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder.    This position reports to the Product Manager of Career Coach.", "Retrieval Date": "2021-02-18", "Link": "https://jobs.lever.co/economicmodeling/d7aa3f0f-261a-44b0-ac8f-346fff74aca6", "Company": "economicmodeling", "id": "d7aa3f0f-261a-44b0-ac8f-346fff74aca6"}
{"Position Title": "Economic Analyst, Higher Education", "Position Location": "Moscow, ID ", "Team": "Higher Education", "Category": "Professional Services ", "Position Description": "The Economic Analyst at Emsi works with the Higher Education (HE) Consulting team to produce innovative datasets, data models, visualizations, and reports that answer our clients’ most pressing problems. A successful candidate will bring a passion for finding creative ways to apply data to solve client problems by developing and bringing to market actionable insights. In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder.", "Retrieval Date": "2021-02-18", "Link": "https://jobs.lever.co/economicmodeling/912f06cf-a3af-41d2-8ee6-32655fe3ccd2", "Company": "economicmodeling", "id": "912f06cf-a3af-41d2-8ee6-32655fe3ccd2"}
{"Position Title": "Join Our Talent Network!", "Position Location": "Moscow, ID ", "Team": "Talent Network ", "Category": null, "Position Description": "Didn't find a job posting, but want to keep in touch? Submit your resume here, and we will reach out with any job openings that we think could be a good fit.  If you have any questions about Emsi, feel free to reach out to Aine Haynes, Talent Acquisition Specialist, at aine.haynes@economicmodeling.com", "Retrieval Date": "2021-02-18", "Link": "https://jobs.lever.co/economicmodeling/ad5f4959-9276-4fba-8ddf-390446c6b95c", "Company": "economicmodeling", "id": "ad5f4959-9276-4fba-8ddf-390446c6b95c"}
{"Position Title": "Account Executive, Universities", "Position Location": "Moscow, ID ", "Team": "Higher Education", "Category": "Sales ", "Position Description": "Emsi is hiring a results-driven Account Executive who is passionate about customer success in the University market. We are looking for someone who will combine exceptional leadership and quantitative analysis skills, with the ability to work effectively in a highly dynamic environment.   As an Account Executive, you will be responsible for generating revenue via the phone and in-person visits with decision makers at Higher Education institutions.  This will involve focusing on driving new market share by prospecting, developing, maintaining and closing business with clients in a defined territory.  You should be highly-organized and detail-oriented, with the ability to manage multiple competing priorities. Furthermore, it is important that you display excellent verbal and written communication, interpersonal, and presentation skills.", "Retrieval Date": "2021-02-18", "Link": "https://jobs.lever.co/economicmodeling/31bc3b10-224f-4f19-a3c6-e1a0a5059ead", "Company": "economicmodeling", "id": "31bc3b10-224f-4f19-a3c6-e1a0a5059ead"}
{"Position Title": "Marketing Specialist", "Position Location": "Moscow, ID ", "Team": "Talent", "Category": "Marketing ", "Position Description": "Emsi is searching for a full time (40 hr/week) Marketing Specialist to join our Talent team. This role is an opportunity to gain hands-on experience working with a CRM, managing email marketing, and executing written content.  Typical projects could include: executing and optimizing marketing emails, organizing webinars, writing press releases to announce Emsi’s new business partnerships, tracking campaigns and more.  We are looking for someone who is a self starter and can execute with minimal oversight, has strong organizational skills and is a quick and independent learner. This person should also have strong critical thinking and problem solving skills.", "Retrieval Date": "2021-02-18", "Link": "https://jobs.lever.co/economicmodeling/e5382e42-7d63-49dc-9ad1-ac8c215b6453", "Company": "economicmodeling", "id": "e5382e42-7d63-49dc-9ad1-ac8c215b6453"}
{"Position Title": "Account Manager, Higher Education", "Position Location": "Moscow, ID ", "Team": "Higher Education", "Category": "Client Services ", "Position Description": "Provide top notch customer service experience and maximize customer success with our products. In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder.", "Retrieval Date": "2021-02-18", "Link": "https://jobs.lever.co/economicmodeling/c97d9f0f-4809-4d2f-80a5-aea4d7c5a479", "Company": "economicmodeling", "id": "c97d9f0f-4809-4d2f-80a5-aea4d7c5a479"}
{"Position Title": "Product Marketer - Emsi Skills", "Position Location": "Moscow, ID ", "Team": "Corporate", "Category": "Marketing ", "Position Description": "Emsi Skills is a free website / resource that houses Emsi’s library of 30,000 skills plus an array of prototypes. The site helps people access our library and serves as a powerful entry point for much of the work we do around skills.  This position will work with the director of the project to (1) grow and improve the site, (2) promote the site to large audiences, (3) serve the community that uses the site (internal Emsi employees and external Emsi clients), (4) coordinate across many different groups to execute and deliver projects, and (5) create content (case studies, blog posts, etc) to help promote the site. In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder. ", "Retrieval Date": "2021-02-18", "Link": "https://jobs.lever.co/economicmodeling/c954a7bb-6312-4a9f-8168-b571458245ea", "Company": "economicmodeling", "id": "c954a7bb-6312-4a9f-8168-b571458245ea"}
{"Position Title": "Graphic Designer", "Position Location": "Moscow, ID ", "Team": "Corporate", "Category": "Marketing ", "Position Description": "In this role you would work with the Marketing team to produce corporate design pieces such as blog graphics, product brochures, PowerPoint presentations, data visualizations, etc. Due to the wide variety of project types, this role requires a broad knowledge of design principles and tools, as well as an eagerness to learn and develop new skills.    ", "Retrieval Date": "2021-02-18", "Link": "https://jobs.lever.co/economicmodeling/526ae978-4794-49b5-b46a-1196ad606e93", "Company": "economicmodeling", "id": "526ae978-4794-49b5-b46a-1196ad606e93"}
{"Position Title": "Graphic Design Intern", "Position Location": "Moscow, ID ", "Team": "Corporate", "Category": "Marketing ", "Position Description": "In this role you would work with the Marketing team to produce data visualizations, infographics, and page layouts. This role will primarily involve the design and layout of Economic Impact Studies for the higher ed consulting team but can transition into additional design and layout opportunities. A successful candidate will bring a desire to learn, a strict attention to detail, ability to meet deadlines, a basic understanding of translating numbers into graphs and charts, and an eye for page design and typography. ", "Retrieval Date": "2021-02-18", "Link": "https://jobs.lever.co/economicmodeling/681f7555-a1eb-4f1b-b7b3-d979c21e9a22", "Company": "economicmodeling", "id": "681f7555-a1eb-4f1b-b7b3-d979c21e9a22"}
{"Position Title": "Corporate Counsel", "Position Location": "Moscow, ID ", "Team": "Corporate", "Category": "Legal ", "Position Description": "Emsi is a fast-growing labor market data and analytics company headquartered in Moscow, Idaho. We are looking to hire a full-time attorney to join our in-house legal team.   In this role, you will report to Emsi’s General Counsel, and will work directly with Emsi’s sales and client-services teams – as well as legal, procurement, and leadership within client and vendor organizations – to draft, review, and negotiate commercial contracts. You will also draft and review internal employment and policy documents, and assist Emsi’s General Counsel and Contract Manager in managing Emsi’s client, vendor, and internal legal documents.   Because Emsi is a fast-growing company (we are moving into a newly-built corporate headquarters in Moscow ID in December 2020), you will have abundant opportunities to expand your responsibilities as Corporate Counsel. Emsi’s General Counsel serves the day-to-day contract needs of Emsi’s sales and client services operations, but also serves the important role of trusted advisor in many aspects of Emsi’s business, including strategic planning and decision making, internal policymaking, and personnel management. So, as a member of Emsi’s legal team, you will have frequent opportunities to grow both your legal and corporate career experience as you contribute to Emsi’s success in all facets of the business.   Emsi legal takes seriously the company’s foundational commitment to bless Emsi’s customers, employees, and shareholders. If you are interested in being an important part of that mission, please apply below. ", "Retrieval Date": "2021-02-18", "Link": "https://jobs.lever.co/economicmodeling/912d55ec-0246-4095-8c81-bbc993a1fd8b", "Company": "economicmodeling", "id": "912d55ec-0246-4095-8c81-bbc993a1fd8b"}
{"Position Title": "Sr. Talent Acquisition Specialist", "Position Location": "Moscow, ID ", "Team": "Corporate", "Category": "Human Resources ", "Position Description": "Location: Moscow, ID  Emsi is growing rapidly, and we are looking for a Sr. Talent Acquisition Specialist to own the hiring process specifically for our sales roles and leadership roles, to proactively bring in talent and build talent pipelines. We are looking for someone who thrives on building relationships and networking with top talent, and who is innovative in their approach.   At Emsi we are committed to our core values of blessing the customer, employee, and shareholders. Our company was founded with the purpose of doing business with high integrity, providing an excellent work environment for people in our community. Hiring excellent candidates is key to continuing that mission. ", "Retrieval Date": "2021-02-18", "Link": "https://jobs.lever.co/economicmodeling/e290ee6d-59f1-4736-93cb-d638e63e97e6", "Company": "economicmodeling", "id": "e290ee6d-59f1-4736-93cb-d638e63e97e6"}
{"Position Title": "Financial Analyst", "Position Location": "Moscow, ID ", "Team": "Corporate", "Category": "Finance ", "Position Description": "The Financial Analyst is part of the Emsi finance team and plays a crucial role in our execution of growth initiatives and constant innovation around optimizing and evaluating existing revenue and expenditure. Success in the role will require a mastery of our culture, history and operating principles to help ensure robust and thorough analysis and prevent flawed analytical results even if “technically correct.” Forms of data involved in this role are not limited to financial but will also include a wide array of operational and HR data with qualitative information and insights. The operating principle for all analysis will be production of meaningful and true analysis, never reducing to the production of numbers to support decisions stakeholders have already made. In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder.", "Retrieval Date": "2021-02-18", "Link": "https://jobs.lever.co/economicmodeling/53b36bf2-ebe0-412b-aec2-bc0c4ab2345d", "Company": "economicmodeling", "id": "53b36bf2-ebe0-412b-aec2-bc0c4ab2345d"}
{"Position Title": "Lead Software Engineer", "Position Location": "Moscow, ID ", "Team": "Corporate", "Category": "Engineering ", "Position Description": "Emsi is a trusted advisor on labor market information for customers across a wide array of markets. We build SaaS products that combine many different kinds of workforce data to accurately inform our clients’ decisions about college course offerings, hiring, site selection, economic development, and much more. We need a senior front end developer to lead a small team that will build new data-heavy web applications.", "Retrieval Date": "2021-02-18", "Link": "https://jobs.lever.co/economicmodeling/3b6c3fe9-ba9c-4193-9990-7b9f3d12f9ab", "Company": "economicmodeling", "id": "3b6c3fe9-ba9c-4193-9990-7b9f3d12f9ab"}
{"Position Title": "Full Stack Web Developer", "Position Location": "Moscow, ID ", "Team": "Corporate", "Category": "Engineering ", "Position Description": "Emsi is a trusted advisor on labor market information for customers across a wide array of markets. We build SaaS products that combine many different kinds of workforce data to accurately inform our clients’ decisions about college course offerings, hiring, site selection, economic development, and much more. We need an experienced developer to join us in producing premier software tools for understanding labor market data.   If you’re ready to join a high-functioning team of full stack devs working closely with product managers, data engineers, and designers to create interfaces and visualizations that make nuanced data intelligible, we’d love to hear from you. Applicants to this posting will be considered for positions on the Analyst, CareerCoach, and SkillsMatch development teams. ", "Retrieval Date": "2021-02-18", "Link": "https://jobs.lever.co/economicmodeling/3e4d2eca-5bc7-4309-b27d-373938c1ce59", "Company": "economicmodeling", "id": "3e4d2eca-5bc7-4309-b27d-373938c1ce59"}
{"Position Title": "Software Engineer", "Position Location": "Moscow, ID ", "Team": "Corporate", "Category": "Data and Analytics ", "Position Description": "Emsi is looking for a skilled software engineer to work on the Classifiers & Extractors team.  This team builds and maintains high-performance text extraction and classification libraries used to analyze job postings, resumes, and similar documents.  In addition to the machine learning solutions, this team also produces the internal tooling and data pipelines to support teams of taxonomists and curators working to continuously improve Emsi’s classifications and libraries.  The ideal candidate has significant experience working in high-performance systems languages, a working knowledge of linear algebra, and at least basic familiarity with machine learning techniques", "Retrieval Date": "2021-02-18", "Link": "https://jobs.lever.co/economicmodeling/d4bf3a63-0a62-4b5d-b2d1-15b20ed74180", "Company": "economicmodeling", "id": "d4bf3a63-0a62-4b5d-b2d1-15b20ed74180"}
{"Position Title": "Data Engineer, Web Scraping", "Position Location": "Moscow, ID ", "Team": "Corporate", "Category": "Data and Analytics ", "Position Description": "Emsi is looking for a Data Engineer to work on the Web Scraping team. In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder", "Retrieval Date": "2021-02-18", "Link": "https://jobs.lever.co/economicmodeling/2236a017-a4ba-45ae-b75c-2ced903572fb", "Company": "economicmodeling", "id": "2236a017-a4ba-45ae-b75c-2ced903572fb"}
